app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
    if params[:artist_id]
      a = Artist.find_by(id: params[:artist_id])
      if a.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = a.songs.find_by(id: params[:id])